# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

number = [-9, 3, 6, 0, -2]
number = sum(number)
print(number)
